Revit 2024 API
AnalysisDisplayDeformedShapeSettings.Transparency Property
 Transparency percentage of deformed shape color fill on surfaces
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public int Transparency { get; set; }
Visual Basic
Public Property Transparency As Integer
	Get
	Set
Visual C++
public:
property int Transparency {
	int get ();
	void set (int value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentsInconsistentException |  When setting this property: transparency is less than 0 or greater than 100
See Also
AnalysisDisplayDeformedShapeSettings Class
Autodesk.Revit.DB.Analysis Namespace